var MV = 5; //это задание переменной цифры - тип оператора - number

var MV1 = 5.1; //это задание переменной дробной цифры

alert ('all gad salad das dallas!'); //это просто текст в алерте 

var str = 'huba bubaэ'// это задание текста для переменной строки обязательно ковычки

//тип оператора Boolean

var flag = true;
var flag1 = false;

//null - значение не определено

var nullvar = null;

//undefined

var notdef = undefined;

//typeof - присвоение переменной такого же ТИПА - а не значения! - перменной как уже был 

var gur;

gur = typeof MV;

alert (gur);

// операторы
var a = 3;
var b = '2';
var c = a - +b;
var d = c * a;

d++; //этот оператор прибаляет к переменной единицу 1

alert (--d); //этот оператор уменьшает переменную на 1 перед тем как вывести значение,, можно и после поставить

d +=10; // этот оператор изменяет - перед равно - +-*/ переменную на указанное значение;

alert (d);

var watsup = (b <= d); // это логический оператор - присвоит значение тру или фолс для переменной ватсап - это - т.е. типа оператора - Буулин - при этом проверка на равенство!!! это == а не = при этом === это строгое сравнение - чтобы скрипт не приводил строку в цифру к примеру... и... != - это неравно!!!

alert (watsup); 